examples/EmberPaperCases/FenceHeight/72ft/ab_YesFenceNoHouse/a_windSim/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cmu^0.75 * k^1.5 / L, where Cmu = 0.09, and L = 10. In my case k = 1.08919 to 1.08943 for the entire inlet domain edge. The average value is 1.08930
// formula seen in Wind Around Buildings tutorial, explained here: https://cfd.direct/openfoam/user-guide/v9-cavity/#x5-340002.1.8
epsilonInlet  0.01868112977;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{

    xMin
    {
        type                    logProfileDissipationRateInlet;
        UfreeStream             8.9408;    // 20 mph
        uDirection              (1 0 0);
        inputWindHeight_Veg     6.095999805;    // 20 ft
        z0                      0.01;
        Rd                      0;
        firstCellHeight         3.6576;  // dz. 12 ft
    }
    xMax
    {
        type            zeroGradient;
    }
    yMin
    {
        type            zeroGradient;
    }
	yMax
    {
        type            zeroGradient;
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
        type            myEpsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform $epsilonInlet;
    }
    
    
    cube
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1;
    }
    
}


// ************************************************************************* //
