examples/EmberPaperCases/FenceHeight/72ft/ab_YesFenceNoHouse/a_windSim/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
);

regions
(
	boxToCell
    {
        // this represents an H x 4H x H vegetation fence to be placed 10H downwind in x with 10H on each side in y
        // the vegetation fence consisting of 4 completely fully grown and old oak trees of size L x W x H, with L == W == H and H = 72 ft
        // so the vegetation fence is 72 ft x 288 ft x 72 ft (21.9456 m x 87.7824 m x 21.9456 m), 
        // placed 10H = 10*72 ft = 720 ft (219.4560 m) to 10H + 1H = 11H = 11*72 ft = 792 ft (241.4016 m) in x,
        // placed 10H = 10*72 ft = 720 ft (219.4560 m) to 10H + 4H (288 ft) = 14H = 14*72 ft = 1008 ft (307.2384 m) in y
        // placed 0H = 0 ft (0 m) to 1H = 72 ft (21.9456 m) in z
        // make sure to do at least 4 decimal places in calculations from ft to m to reduce round off error when being used with the mesh resolution
        box ( 219.4560 219.4560 0.0000) ( 241.4016 307.2384 21.9456);
        fieldValues
        (
            volScalarFieldValue  Cd 0.5
            volScalarFieldValue LAD 10
        );
    }
);


// ************************************************************************* //
